In [ ]:
import pandas as pd

df = pd.read_csv('data/airports.csv')
df.head()

,iata,name,city,state,country,latitude,longitude
0,00M,Thigpen,Bay Springs,MS,USA,31.953765,-89.234505
1,00M,Thigpen,Bay Springs,MS,USA,31.953765,-89.234505
2,00R,Livingston Municipal,Livingston,TX,USA,30.685861,-95.017928
3,00V,Meadow Lake,Colorado Springs,CO,USA,38.945749,-104.569893
4,01G,Perry-Warsaw,Perry,NY,USA,42.741347,-78.052081

In [ ]:
# I want to see the tail of the dataframe. How can I do that?
df.tail()

,iata,name,city,state,country,latitude,longitude
3374,ZPH,Zephyrhills Municipal,Zephyrhills,FL,USA,28.228065,-82.155916
3375,ZUN,Black Rock,Zuni,NM,USA,35.083227,-108.791777
3376,ZZV,Zanesville Municipal,Zanesville,OH,USA,39.944458,-81.892105
3377,RDU,Raleigh-Durham International,NaN,NC,USA,35.877639,-78.787472
3378,RDU,Raleigh-Durham International,NaN,NC,USA,35.877639,-78.787472

In [ ]:
# I want to filter the dataframe to only include airports in the state CA. How can I do that?
df[df['state'] == 'CA']

,iata,name,city,state,country,latitude,longitude
74,0O3,Calaveras Co-Maury Rasmussen,San Andreas,CA,USA,38.146116,-120.648173
75,0O4,Corning Municipal,Corning,CA,USA,39.943768,-122.171378
76,0O5,University,Davis,CA,USA,38.531462,-121.786491
77,0Q5,Shelter Cove,Shelter Cove,CA,USA,40.027643,-124.073364
78,0Q6,Shingletown,Shingletown,CA,USA,40.522101,-121.817768
...,...,...,...,...,...,...,...
3251,VNY,Van Nuys,Van Nuys,CA,USA,34.209810,-118.489973
3294,WHP,Whiteman,Los Angeles,CA,USA,34.259325,-118.413433
3295,WJF,General Wm. J. Fox Airfield,Lancaster,CA,USA,34.740959,-118.218949
3298,WLW,Willows-Glenn County,Willows,CA,USA,39.516354,-122.217511
3308,WVI,Watsonville Municipal,Watsonville,CA,USA,36.935730,-121.789618

In [ ]:
# i want to filter the dataframe to only include airports in the state CA and city Los Angeles. How can I do that?
df[(df['state'] == 'CA') & (df['city'] == 'Los Angeles')]

,iata,name,city,state,country,latitude,longitude
2040,LAX,Los Angeles International,Los Angeles,CA,USA,33.942536,-118.408074
3294,WHP,Whiteman,Los Angeles,CA,USA,34.259325,-118.413433

In [6]:
# Print the number of airports in the state CA
print(len(df[df['state'] == 'CA']))

205

In [7]:
# Find the duplicate rows in the dataframe
df[df.duplicated()]

,iata,name,city,state,country,latitude,longitude
1,00M,Thigpen,Bay Springs,MS,USA,31.953765,-89.234505
3378,RDU,Raleigh-Durham International,NaN,NC,USA,35.877639,-78.787472

In [8]:
# drop the duplicate rows
df.drop_duplicates(inplace=True)

In [9]:
df[df.duplicated()]

Empty DataFrame
Columns: [iata, name, city, state, country, latitude, longitude]
Index: []

In [10]:
# Find the unique values in the state column
df['state'].unique()

array(['MS', 'TX', 'CO', 'NY', 'FL', 'AL', 'WI', 'OH', 'MO', 'MN', 'IN',
       'NV', 'IL', 'ND', 'MI', 'NE', 'GA', 'DC', 'TN', 'AK', 'ME', 'MA',
       'VT', 'SD', 'NM', 'OK', 'KS', 'KY', 'IA', 'AR', 'LA', 'CA', 'WA',
       'VA', 'AZ', 'PA', 'NJ', 'OR', 'NC', 'UT', 'MT', 'ID', 'CT', 'SC',
       'NH', 'MD', 'DE', 'WV', 'WY', 'PR', 'RI', nan, 'AS', 'CQ', 'GU',
       'HI', 'VI'], dtype=object)

In [11]:
# Find the number of unique values in the state column
df['state'].nunique()

56

In [12]:
# Find the NaN values in the dataframe
df.isnull().sum()

iata          0
name          0
city         13
state        12
country       0
latitude      0
longitude     0
dtype: int64

In [13]:
# Find the number of NaN values in the City column
df['city'].isnull().sum()

13

In [15]:
# Drop the NaN values in the City column
df.dropna(subset=['city'], inplace=True)

In [16]:
# Value counts of the state column
df['state'].value_counts()

state
AK    263
TX    209
CA    205
OK    102
FL    100
OH    100
GA     97
NY     97
MI     94
MN     89
IL     88
WI     84
KS     78
IA     78
MO     74
AR     74
AL     73
NE     73
NC     72
MS     72
MT     71
PA     71
TN     70
IN     65
WA     65
AZ     59
OR     57
SD     57
LA     55
ND     52
SC     52
NM     51
KY     50
CO     49
VA     47
ID     37
UT     35
NJ     35
ME     34
NV     32
WY     32
MA     30
WV     24
MD     18
HI     16
CT     15
NH     14
VT     13
PR     11
RI      6
DE      5
VI      5
CQ      4
AS      3
DC      1
GU      1
Name: count, dtype: int64

In [17]:
# Value counts of the state column in percentage
df['state'].value_counts(normalize=True) * 100

state
AK    7.818074
TX    6.212842
CA    6.093936
OK    3.032105
FL    2.972652
OH    2.972652
GA    2.883472
NY    2.883472
MI    2.794293
MN    2.645660
IL    2.615933
WI    2.497027
KS    2.318668
IA    2.318668
MO    2.199762
AR    2.199762
AL    2.170036
NE    2.170036
NC    2.140309
MS    2.140309
MT    2.110583
PA    2.110583
TN    2.080856
IN    1.932224
WA    1.932224
AZ    1.753864
OR    1.694411
SD    1.694411
LA    1.634958
ND    1.545779
SC    1.545779
NM    1.516052
KY    1.486326
CO    1.456599
VA    1.397146
ID    1.099881
UT    1.040428
NJ    1.040428
ME    1.010702
NV    0.951249
WY    0.951249
MA    0.891795
WV    0.713436
MD    0.535077
HI    0.475624
CT    0.445898
NH    0.416171
VT    0.386445
PR    0.326992
RI    0.178359
DE    0.148633
VI    0.148633
CQ    0.118906
AS    0.089180
DC    0.029727
GU    0.029727
Name: proportion, dtype: float64

In [18]:
# Group by the state column and find the mean of the lat column
df.groupby('state')['latitude'].mean()

state
AK    61.334311
AL    32.633309
AR    35.073206
AS    14.243716
AZ    34.000364
CA    36.980962
CO    39.199335
CQ    15.603651
CT    41.559352
DC    38.868723
DE    39.247359
FL    28.198511
GA    32.694875
GU    13.483450
HI    20.988746
IA    41.947502
ID    44.581385
IL    40.267874
IN    40.163399
KS    38.421462
KY    37.519445
LA    31.189170
MA    42.179898
MD    38.976022
ME    44.845315
MI    43.670830
MN    45.685940
MO    38.277351
MS    32.874658
MT    47.074936
NC    35.499670
ND    47.533184
NE    41.279238
NH    43.404604
NJ    40.219450
NM    34.437568
NV    38.625871
NY    42.482777
OH    40.396680
OK    35.529944
OR    44.340365
PA    40.696152
PR    18.303695
RI    41.548682
SC    33.914399
SD    44.298703
TN    35.815482
TX    31.484807
UT    39.254065
VA    37.518450
VI    18.092371
VT    44.075020
WA    47.468242
WI    44.343157
WV    38.676902
WY    42.860226
Name: latitude, dtype: float64

In [20]:
# Value counts of the state column where the count is greater than 50
df['state'].value_counts()[df['state'].value_counts() > 50]

state
AK    263
TX    209
CA    205
OK    102
FL    100
OH    100
GA     97
NY     97
MI     94
MN     89
IL     88
WI     84
KS     78
IA     78
MO     74
AR     74
AL     73
NE     73
NC     72
MS     72
MT     71
PA     71
TN     70
IN     65
WA     65
AZ     59
OR     57
SD     57
LA     55
ND     52
SC     52
NM     51
Name: count, dtype: int64

In [21]:
# Find unique values of the city, state and country columns
df[['city', 'state', 'country']].drop_duplicates()

                  city state country
0          Bay Springs    MS     USA
2           Livingston    TX     USA
3     Colorado Springs    CO     USA
4                Perry    NY     USA
5             Hilliard    FL     USA
...                ...   ...     ...
3372             Elkin    NC     USA
3373        Pottsville    PA     USA
3374       Zephyrhills    FL     USA
3375              Zuni    NM     USA
3376        Zanesville    OH     USA

[3189 rows x 3 columns]

In [22]:
# create a dataframe with dtype == object
df.select_dtypes(include='object')

     iata                       name              city state country
0     00M                    Thigpen       Bay Springs    MS     USA
2     00R       Livingston Municipal        Livingston    TX     USA
3     00V                Meadow Lake  Colorado Springs    CO     USA
4     01G               Perry-Warsaw             Perry    NY     USA
5     01J           Hilliard Airpark          Hilliard    FL     USA
...   ...                        ...               ...   ...     ...
3372  ZEF            Elkin Municipal             Elkin    NC     USA
3373  ZER  Schuylkill Cty/Joe Zerbey        Pottsville    PA     USA
3374  ZPH      Zephyrhills Municipal       Zephyrhills    FL     USA
3375  ZUN                 Black Rock              Zuni    NM     USA
3376  ZZV       Zanesville Municipal        Zanesville    OH     USA

[3364 rows x 5 columns]

In [23]:
# use a for loop to print the unique values in the object columns
for col in df.select_dtypes(include='object').columns:
    print(df[col].unique())

['00M' '00R' '00V' ... 'ZPH' 'ZUN' 'ZZV']
['Thigpen' 'Livingston Municipal' 'Meadow Lake' ...
 'Zephyrhills Municipal' 'Black Rock' 'Zanesville Municipal']
['Bay Springs' 'Livingston' 'Colorado Springs' ... 'Zephyrhills' 'Zuni'
 'Zanesville']
['MS' 'TX' 'CO' 'NY' 'FL' 'AL' 'WI' 'OH' 'MO' 'MN' 'IN' 'NV' 'IL' 'ND'
 'MI' 'NE' 'GA' 'DC' 'TN' 'AK' 'ME' 'MA' 'VT' 'SD' 'NM' 'OK' 'KS' 'KY'
 'IA' 'AR' 'LA' 'CA' 'WA' 'VA' 'AZ' 'PA' 'NJ' 'OR' 'NC' 'UT' 'MT' 'ID'
 'CT' 'SC' 'NH' 'MD' 'DE' 'WV' 'WY' 'PR' 'RI' 'AS' 'CQ' 'GU' 'HI' 'VI']
['USA']